In [1]:
import pandas as pd
import numpy as np
import seaborn as sns

In [2]:
df = sns.load_dataset('titanic')
df

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [3]:
df['survived']

0      0
1      1
2      1
3      1
4      0
      ..
886    0
887    1
888    0
889    1
890    0
Name: survived, Length: 891, dtype: int64

In [4]:
df[['survived', 'age']]

     survived   age
0           0  22.0
1           1  38.0
2           1  26.0
3           1  35.0
4           0  35.0
..        ...   ...
886         0  27.0
887         1  19.0
888         0   NaN
889         1  26.0
890         0  32.0

[891 rows x 2 columns]

In [11]:
titanic = df[['survived','pclass','age','fare','sex','alone','parch', 'embark_town']].copy()
titanic

     survived  pclass   age     fare     sex  alone  parch  embark_town
0           0       3  22.0   7.2500    male  False      0  Southampton
1           1       1  38.0  71.2833  female  False      0    Cherbourg
2           1       3  26.0   7.9250  female   True      0  Southampton
3           1       1  35.0  53.1000  female  False      0  Southampton
4           0       3  35.0   8.0500    male   True      0  Southampton
..        ...     ...   ...      ...     ...    ...    ...          ...
886         0       2  27.0  13.0000    male   True      0  Southampton
887         1       1  19.0  30.0000  female   True      0  Southampton
888         0       3   NaN  23.4500  female  False      2  Southampton
889         1       1  26.0  30.0000    male   True      0    Cherbourg
890         0       3  32.0   7.7500    male   True      0   Queenstown

[891 rows x 8 columns]

In [12]:
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 8 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   age          714 non-null    float64
 3   fare         891 non-null    float64
 4   sex          891 non-null    object
 5   alone        891 non-null    bool
 6   parch        891 non-null    int64
 7   embark_town  889 non-null    object
dtypes: bool(1), float64(2), int64(3), object(2)
memory usage: 49.7+ KB

In [13]:
titanic.isnull().sum()

survived         0
pclass           0
age            177
fare             0
sex              0
alone            0
parch            0
embark_town      2
dtype: int64

missing data
1. numeric data => mean
2. categorical data => mode

In [14]:
titanic

     survived  pclass   age     fare     sex  alone  parch  embark_town
0           0       3  22.0   7.2500    male  False      0  Southampton
1           1       1  38.0  71.2833  female  False      0    Cherbourg
2           1       3  26.0   7.9250  female   True      0  Southampton
3           1       1  35.0  53.1000  female  False      0  Southampton
4           0       3  35.0   8.0500    male   True      0  Southampton
..        ...     ...   ...      ...     ...    ...    ...          ...
886         0       2  27.0  13.0000    male   True      0  Southampton
887         1       1  19.0  30.0000  female   True      0  Southampton
888         0       3   NaN  23.4500  female  False      2  Southampton
889         1       1  26.0  30.0000    male   True      0    Cherbourg
890         0       3  32.0   7.7500    male   True      0   Queenstown

[891 rows x 8 columns]

In [15]:
titanic['survived'].value_counts()

0    549
1    342
Name: survived, dtype: int64

In [20]:
titanic['parch'].value_counts()

0    678
1    118
2     80
5      5
3      5
4      4
6      1
Name: parch, dtype: int64

In [22]:
mean_age = round(titanic['age'].mean())
print(mean_age)

30

In [23]:
titanic['age'].fillna(mean_age, inplace=True)
titanic

     survived  pclass   age     fare     sex  alone  parch  embark_town
0           0       3  22.0   7.2500    male  False      0  Southampton
1           1       1  38.0  71.2833  female  False      0    Cherbourg
2           1       3  26.0   7.9250  female   True      0  Southampton
3           1       1  35.0  53.1000  female  False      0  Southampton
4           0       3  35.0   8.0500    male   True      0  Southampton
..        ...     ...   ...      ...     ...    ...    ...          ...
886         0       2  27.0  13.0000    male   True      0  Southampton
887         1       1  19.0  30.0000  female   True      0  Southampton
888         0       3  30.0  23.4500  female  False      2  Southampton
889         1       1  26.0  30.0000    male   True      0    Cherbourg
890         0       3  32.0   7.7500    male   True      0   Queenstown

[891 rows x 8 columns]

In [24]:
titanic['embark_town'].value_counts()

Southampton    644
Cherbourg      168
Queenstown      77
Name: embark_town, dtype: int64

In [25]:
common_embark_town = titanic['embark_town'].value_counts().idxmax()
titanic['embark_town'].fillna(common_embark_town, inplace=True)
titanic

     survived  pclass   age     fare     sex  alone  parch  embark_town
0           0       3  22.0   7.2500    male  False      0  Southampton
1           1       1  38.0  71.2833  female  False      0    Cherbourg
2           1       3  26.0   7.9250  female   True      0  Southampton
3           1       1  35.0  53.1000  female  False      0  Southampton
4           0       3  35.0   8.0500    male   True      0  Southampton
..        ...     ...   ...      ...     ...    ...    ...          ...
886         0       2  27.0  13.0000    male   True      0  Southampton
887         1       1  19.0  30.0000  female   True      0  Southampton
888         0       3  30.0  23.4500  female  False      2  Southampton
889         1       1  26.0  30.0000    male   True      0    Cherbourg
890         0       3  32.0   7.7500    male   True      0   Queenstown

[891 rows x 8 columns]